Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ0512EFE124.atdf
         <register caption="External Bus Interface Control Pin Configuration Register" name="CFGEBIC" offset="0xd0" rw="RW" size="4">
            <bitfield caption="EBI Data Lower Byte Pin Enable bit" mask="0x00000001" name="EBIDEN0" values="CFGEBIC__EBIDEN0"/>
            <bitfield caption="EBI Data Upper Byte Pin Enable bit" mask="0x00000002" name="EBIDEN1" values="CFGEBIC__EBIDEN1"/>
            <bitfield caption="/EBICS0 Pin Enable bit" mask="0x00000010" name="EBICSEN0" values="CFGEBIC__EBICSEN0"/>
            <bitfield caption="/EBICS1 Pin Enable bit" mask="0x00000020" name="EBICSEN1" values="CFGEBIC__EBICSEN1"/>
            <bitfield caption="/EBICS2 Pin Enable bit" mask="0x00000040" name="EBICSEN2" values="CFGEBIC__EBICSEN2"/>
            <bitfield caption="/EBICS3 Pin Enable bit" mask="0x00000080" name="EBICSEN3" values="CFGEBIC__EBICSEN3"/>
            <bitfield caption="/EBIBS0 Pin Enable bit" mask="0x00000100" name="EBIBSEN0" values="CFGEBIC__EBIBSEN0"/>
            <bitfield caption="/EBIBS1 Pin Enable bit" mask="0x00000200" name="EBIBSEN1" values="CFGEBIC__EBIBSEN1"/>
            <bitfield caption="/EBIOE Pin Enable bit" mask="0x00001000" name="EBIOEEN" values="CFGEBIC__EBIOEEN"/>
            <bitfield caption="/EBIWE Pin Enable bit" mask="0x00002000" name="EBIWEEN" values="CFGEBIC__EBIWEEN"/>
            <bitfield caption="/EBIRP Pin Sensitivity Control bit" mask="0x00010000" name="EBIRPEN" values="CFGEBIC__EBIRPEN"/>
            <bitfield caption="EBIRDYx Pin Sensitivity Control bit" mask="0x00020000" name="EBIRDYLVL" values="CFGEBIC__EBIRDYLVL"/>
            <bitfield caption="EBIRDY1 Pin Enable bit" mask="0x02000000" name="EBIRDYEN1" values="CFGEBIC__EBIRDYEN1"/>
            <bitfield caption="EBIRDY2 Pin Enable bit" mask="0x04000000" name="EBIRDYEN2" values="CFGEBIC__EBIRDYEN2"/>
            <bitfield caption="EBIRDY3 Pin Enable bit" mask="0x08000000" name="EBIRDYEN3" values="CFGEBIC__EBIRDYEN3"/>
            <bitfield caption="EBIRDY1 Inversion Control bit" mask="0x20000000" name="EBIRDYINV1" values="CFGEBIC__EBIRDYINV1"/>
            <bitfield caption="EBIRDY2 Inversion Control bit" mask="0x40000000" name="EBIRDYINV2" values="CFGEBIC__EBIRDYINV2"/>
            <bitfield caption="EBIRDY3 Inversion Control bit" mask="0x80000000" name="EBIRDYINV3" values="CFGEBIC__EBIRDYINV3"/>
         </register>
         <register caption="Permission Group Configuration Register" name="CFGPG" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CPUPG"/>
            <bitfield mask="0x00000030" name="DMAPG"/>
            <bitfield mask="0x00000300" name="USBPG"/>
            <bitfield mask="0x00003000" name="CAN1PG"/>
            <bitfield mask="0x0000C000" name="CAN2PG"/>
            <bitfield mask="0x00030000" name="ETHPG"/>
            <bitfield mask="0x00300000" name="SQI1PG"/>
            <bitfield mask="0x00C00000" name="FCPG"/>
            <bitfield caption="Crypto Engine Permission Group bits" mask="0x03000000" name="CRYPTPG" values="CFGPG__CRYPTPG"/>
            <bitfield mask="0xC0000000" name="ICD1PG"/>
         </register>
      </register-group>
      <value-group caption="Silicon Revision" name="DEVID__VER">
         <value caption="Revision A1" name="" value="0x10000000"/>
         <value caption="Revision A3" name="" value="0x30000000"/>
         <value caption="Revision B2" name="" value="0x60000000"/>
      </value-group>
      <value-group caption="TDO Enable for 2-Wire JTAG" name="CFGCON__TDOEN">
         <value caption="2-wire JTAG protocol uses TDO" name="" value="0x1"/>
         <value caption="2-wire JTAG protocol does not use TDO" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trace Output Enable bit" name="CFGCON__TROEN">
         <value caption="Enable trace outputs and start trace clock (trace probe must be present)" name="" value="0x1"/>
         <value caption="Disable trace outputs and stop trace clock" name="" value="0x0"/>
      </value-group>
      <value-group caption="JTAG Port Enable bit" name="CFGCON__JTAGEN">
         <value caption="Enable the JTAG port" name="" value="0x1"/>
         <value caption="Disable the JTAG port" name="" value="0x0"/>
      </value-group>
      <value-group caption="Flash ECC Configuration bits" name="CFGCON__ECCCON">
         <value caption="ECC and dynamic ECC are disabled (ECCCON bits are writable)" name="" value="0x3"/>
         <value caption="ECC and dynamic ECC are disabled (ECCCON bits are locked)" name="" value="0x2"/>
         <value caption="Dynamic Flash ECC is enabled (ECCCON bits are locked)" name="" value="0x1"/>
         <value caption="Flash ECC is enabled (ECCCON bits are locked; disables word Flash writes)" name="" value="0x0"/>
      </value-group>
      <value-group caption="USB Suspend Sleep Enable bit(1)" name="CFGCON__USBSSEN">
         <value caption="USB PHY clock is shut down when Sleep mode is active" name="" value="0x1"/>
         <value caption="USB PHY clock continues to run when Sleep is active" name="" value="0x0"/>
      </value-group>
      <value-group caption="Permission Group Lock bit(1)" name="CFGCON__PGLOCK">
         <value caption="Permission Group registers are locked. Writes to PG registers are not allowed" name="" value="0x1"/>
         <value caption="Permission Group registers are not locked. Writes to PG registers are allowed" name="" value="0x0"/>
      </value-group>
      <value-group caption="Peripheral Module Disable bit(1)" name="CFGCON__PMDLOCK">
         <value caption="Peripheral module is locked. Writes to PMD registers are not allowed" name="" value="0x1"/>
         <value caption="Peripheral module is not locked. Writes to PMD registers are allowed" name="" value="0x0"/>
      </value-group>
      <value-group caption="Peripheral Pin Select Lock bit(1)" name="CFGCON__IOLOCK">
         <value caption="Peripheral Pin Select is locked. Writes to PPS registers are not allowed" name="" value="0x1"/>
         <value caption="Peripheral Pin Select is not locked. Writes to PPS registers are allowed" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Compare Alternate Clock Selection bit(1)" name="CFGCON__OCACLK">
         <value caption="Output Compare modules use an alternative Timer pair as their timebase clock" name="" value="0x1"/>
         <value caption="All Output Compare modules use Timer2/3 as their timebase clock" name="" value="0x0"/>
      </value-group>
      <value-group caption="Input Capture Alternate Clock Selection bit(1)" name="CFGCON__ICACLK">
         <value caption="Input Capture modules use an alternative Timer pair as their timebase clock" name="" value="0x1"/>
         <value caption="All Input Capture modules use Timer2/3 as their timebase clock" name="" value="0x0"/>
      </value-group>
