Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ0512EFE124.atdf
   <module caption="" id="01539" name="JTAG" version="2">
      <register-group name="JTAG">
         <register caption="" name="_ICDCON" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CKSWBKEN"/>
            <bitfield mask="0x00000002" name="SLPBKEN"/>
            <bitfield mask="0x00000004" name="WDTBKEN"/>
            <bitfield mask="0x00000008" name="WDTEN"/>
            <bitfield mask="0x00000010" name="RSTBUG"/>
            <bitfield mask="0x00000020" name="DMTBKEN"/>
            <bitfield mask="0x00000040" name="DMTEN"/>
            <bitfield mask="0x00004000" name="FRZ"/>
         </register>
         <register caption="" name="_ICDSTAT" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CKSWBF"/>
            <bitfield mask="0x00000002" name="SLPBF"/>
            <bitfield mask="0x00000004" name="WDTBF"/>
            <bitfield mask="0x00000008" name="DMTBF"/>
         </register>
      </register-group>
   </module>
   <module caption="" id="02819" name="NVM" version="2">
      <register-group name="NVM">
         <register caption="Flash Programming Control Register" name="NVMCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="NVM Operation bits" mask="0x0000000F" name="NVMOP" values="NVMCON__NVMOP"/>
            <bitfield caption="Boot Flash Bank Alias Swap Control bit" mask="0x00000040" name="BFSWAP" values="NVMCON__BFSWAP"/>
            <bitfield caption="Program Flash Bank Swap Control bit" mask="0x00000080" name="PFSWAP" values="NVMCON__PFSWAP"/>
            <bitfield caption="Low-Voltage Detect Error bit" mask="0x00001000" name="LVDERR" values="NVMCON__LVDERR"/>
            <bitfield caption="Write Error bit" mask="0x00002000" name="WRERR" values="NVMCON__WRERR"/>
            <bitfield caption="Write Enable bit" mask="0x00004000" name="WREN" values="NVMCON__WREN"/>
            <bitfield caption="Write Control bit" mask="0x00008000" name="WR" values="NVMCON__WR"/>
         </register>
         <register caption="Programming Unlock Register" name="NVMKEY" offset="0x10" rw="W" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMKEY"/>
         </register>
         <register caption="Flash Address Register" name="NVMADDR" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMADDR"/>
         </register>
         <register caption="Flash Data Register (x = 0-3" name="NVMDATA0" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMDATA0"/>
         </register>
         <register caption="Flash Data Register (x = 0-3" name="NVMDATA1" offset="0x40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMDATA1"/>
         </register>
         <register caption="Flash Data Register (x = 0-3" name="NVMDATA2" offset="0x50" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMDATA2"/>
         </register>
         <register caption="Flash Data Register (x = 0-3" name="NVMDATA3" offset="0x60" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMDATA3"/>
         </register>
         <register caption="Source Data Address Register" name="NVMSRCADDR" offset="0x70" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMSRCADDR"/>
         </register>
         <register caption="Program Flash Write-Protect Register" name="NVMPWP" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00FFFFFF" name="PWP"/>
            <bitfield caption="Program Flash Memory Page Write-protect Unlock bit" mask="0x80000000" name="PWPULOCK" values="NVMPWP__PWPULOCK"/>
         </register>
         <register caption="Flash Boot (Page) Write-Protect Register" name="NVMBWP" offset="0x90" rw="RW" size="4">
            <bitfield caption="Upper Boot Alias Page 0 Write-protect bit" mask="0x00000001" name="UBWP0" values="NVMBWP__UBWP0"/>
            <bitfield caption="Upper Boot Alias Page 1 Write-protect bit" mask="0x00000002" name="UBWP1" values="NVMBWP__UBWP1"/>
            <bitfield caption="Upper Boot Alias Page 2 Write-protect bit" mask="0x00000004" name="UBWP2" values="NVMBWP__UBWP2"/>
            <bitfield caption="Upper Boot Alias Page 3 Write-protect bit" mask="0x00000008" name="UBWP3" values="NVMBWP__UBWP3"/>
            <bitfield caption="Upper Boot Alias Page 4 Write-protect bit" mask="0x00000010" name="UBWP4" values="NVMBWP__UBWP4"/>
            <bitfield caption="Upper Boot Alias Write-protect Unlock bit" mask="0x00000100" name="UBWPULOCK" values="NVMBWP__UBWPULOCK"/>
            <bitfield caption="Lower Boot Alias Page 0 Write-protect bit" mask="0x00000200" name="LBWP0" values="NVMBWP__LBWP0"/>
            <bitfield caption="Lower Boot Alias Page 1 Write-protect bit" mask="0x00000400" name="LBWP1" values="NVMBWP__LBWP1"/>
            <bitfield caption="Lower Boot Alias Page 2 Write-protect bit" mask="0x00000800" name="LBWP2" values="NVMBWP__LBWP2"/>
            <bitfield caption="Lower Boot Alias Page 3 Write-protect bit" mask="0x00001000" name="LBWP3" values="NVMBWP__LBWP3"/>
            <bitfield caption="Lower Boot Alias Page 4 Write-protect bit" mask="0x00002000" name="LBWP4" values="NVMBWP__LBWP4"/>
            <bitfield caption="Lower Boot Alias Write-protect Unlock bit" mask="0x00004000" name="LBWPULOCK" values="NVMBWP__LBWPULOCK"/>
         </register>
         <register caption="Flash Programming Control Register 2" name="NVMCON2" offset="0xa0" rw="RW" size="4">
            <bitfield caption="Flash Memory Swap Lock Control bits" mask="0x000000C0" name="SWAPLOCK" values="NVMCON2__SWAPLOCK"/>
         </register>
      </register-group>
      <value-group caption="NVM Operation bits" name="NVMCON__NVMOP">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x4"/>
         <value caption="Program erase operation: erase all of program Flash memory (all pages must be unprotected" name="" value="0x3"/>
         <value caption="Upper program Flash memory erase operation: erases only the upper mapped region of program Flash (all pages in that region must be unprotected)" name="" value="0x6"/>
         <value caption="Lower program Flash memory erase operation: erases only the lower mapped region of program Flash (all pages in that region must be unprotected)" name="" value="0x5"/>
         <value caption="Page erase operation: erases page selected by NVMADDR" name="" value="0x4"/>
         <value caption="Row program operation: programs row selected by NVMADDR" name="" value="0x3"/>
         <value caption="Quad Word (128-bit) program operation: programs the 128-bit Flash word selected by NVMADDR" name="" value="0x2"/>
         <value caption="Word program operation: programs word selected by NVMADDR" name="" value="0x1"/>
         <value caption="No operation" name="" value="0x0"/>
      </value-group>
